benchmarks/results/2026-08-17-m2-pro/16k-c64-r3.txt
timestamp_utc=2026-08-17T07:21:25Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/bench-16k.bin
threads=4
connections=64
duration=10s
warmup=3s
command=wrk -t4 -c64 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/bench-16k.bin
Running 10s test @ http://127.0.0.1:18083/bench-16k.bin
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    71.06ms   93.86ms 309.08ms   78.89%
    Req/Sec     5.16k     0.91k    7.07k    67.75%
  Latency Distribution
     50%  268.00us
     75%  141.30ms
     90%  232.29ms
     99%  287.33ms
  205736 requests in 10.03s, 3.16GB read
Requests/sec:  20502.78
Transfer/sec:    322.43MB
requests=205736
duration_us=10034540
bytes=3392576360
latency_p50_us=268.00
latency_p95_us=262809.00
latency_p99_us=287326.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0