benchmarks/results/2026-08-17-m2-pro/index-c1-r1.txt
timestamp_utc=2026-08-17T07:17:50Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=1
connections=1
duration=10s
warmup=3s
command=wrk -t1 -c1 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   104.32us    9.64us 660.00us   87.83%
    Req/Sec     9.38k   218.71    10.57k    78.22%
  Latency Distribution
     50%  101.00us
     75%  108.00us
     90%  113.00us
     99%  137.00us
  94230 requests in 10.10s, 27.85MB read
Requests/sec:   9329.95
Transfer/sec:      2.76MB
requests=94230
duration_us=10099732
bytes=29206590
latency_p50_us=101.00
latency_p95_us=118.00
latency_p99_us=137.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0