benchmarks/results/2026-08-17-m2-pro/index-c16-r2.txt
timestamp_utc=2026-08-17T07:19:24Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=16
duration=10s
warmup=3s
command=wrk -t4 -c16 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.74ms   15.31ms  56.71ms   79.65%
    Req/Sec     6.15k     0.96k    8.07k    66.25%
  Latency Distribution
     50%  187.00us
     75%   20.76ms
     90%   37.80ms
     99%   48.16ms
  245864 requests in 10.07s, 72.68MB read
Requests/sec:  24417.87
Transfer/sec:      7.22MB
requests=245864
duration_us=10069018
bytes=76205555
latency_p50_us=187.00
latency_p95_us=43485.00
latency_p99_us=48163.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0