benchmarks/results/2026-08-17-m2-pro/index-c16-r3.txt
timestamp_utc=2026-08-17T07:20:44Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=16
duration=10s
warmup=3s
command=wrk -t4 -c16 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.75ms   15.31ms  54.79ms   79.65%
    Req/Sec     6.15k     0.93k    8.08k    65.25%
  Latency Distribution
     50%  186.00us
     75%   20.79ms
     90%   37.83ms
     99%   48.12ms
  245642 requests in 10.06s, 72.61MB read
Requests/sec:  24411.59
Transfer/sec:      7.22MB
requests=245642
duration_us=10062517
bytes=76136745
latency_p50_us=186.00
latency_p95_us=43525.00
latency_p99_us=48118.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0