benchmarks/results/2026-08-17-m2-pro/index-c256-r1.txt
timestamp_utc=2026-08-17T07:18:30Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=256
duration=10s
warmup=3s
command=wrk -t4 -c256 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   247.42ms  328.69ms   1.08s    79.11%
    Req/Sec     6.12k     1.05k    9.65k    70.18%
  Latency Distribution
     50%  224.00us
     75%  488.11ms
     90%  813.00ms
     99%    1.01s
  243675 requests in 10.04s, 72.03MB read
Requests/sec:  24279.45
Transfer/sec:      7.18MB
requests=243675
duration_us=10036264
bytes=75527070
latency_p50_us=224.00
latency_p95_us=923877.00
latency_p99_us=1013476.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0