benchmarks/results/2026-08-17-m2-pro/index-c256-r3.txt
timestamp_utc=2026-08-17T07:21:11Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=256
duration=10s
warmup=3s
command=wrk -t4 -c256 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   249.99ms  331.40ms   1.10s    79.08%
    Req/Sec     6.08k     1.12k    9.60k    77.25%
  Latency Distribution
     50%  230.00us
     75%  494.83ms
     90%  820.04ms
     99%    1.02s
  242328 requests in 10.03s, 71.63MB read
Requests/sec:  24155.12
Transfer/sec:      7.14MB
requests=242328
duration_us=10032157
bytes=75109575
latency_p50_us=230.00
latency_p95_us=930679.00
latency_p99_us=1019823.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0