benchmarks/results/2026-08-17-m2-pro/index-c64-r1.txt
timestamp_utc=2026-08-17T07:18:17Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=64
duration=10s
warmup=3s
command=wrk -t4 -c64 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    59.72ms   78.77ms 259.52ms   78.86%
    Req/Sec     6.16k     1.17k    9.08k    69.50%
  Latency Distribution
     50%  221.00us
     75%  118.81ms
     90%  194.87ms
     99%  241.07ms
  245557 requests in 10.03s, 72.58MB read
Requests/sec:  24478.45
Transfer/sec:      7.24MB
requests=245557
duration_us=10031557
bytes=76110405
latency_p50_us=221.00
latency_p95_us=220510.00
latency_p99_us=241065.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0