benchmarks/results/2026-08-17-m2-pro/index-c64-r2.txt
timestamp_utc=2026-08-17T07:19:37Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=64
duration=10s
warmup=3s
command=wrk -t4 -c64 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    59.53ms   78.60ms 261.02ms   78.88%
    Req/Sec     6.16k     1.57k   10.16k    75.50%
  Latency Distribution
     50%  222.00us
     75%  118.55ms
     90%  194.61ms
     99%  240.49ms
  245949 requests in 10.07s, 72.70MB read
Requests/sec:  24425.34
Transfer/sec:      7.22MB
requests=245949
duration_us=10069419
bytes=76231905
latency_p50_us=222.00
latency_p95_us=220072.00
latency_p99_us=240494.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0