benchmarks/results/2026-08-17-m2-pro/index-c64-r3.txt
timestamp_utc=2026-08-17T07:20:58Z
system=Darwin 25.5.0 arm64
cpu=Apple M2 Pro
wrk=wrk 4.2.0 [kqueue] Copyright (C) 2012 Will Glozer
server_commit=a47b1cc
server_build_type=Release
server_workers=4
server_queue_capacity=128
compiler=Apple clang version 21.0.0 (clang-2100.1.1.101)
url=http://127.0.0.1:18083/index.html
threads=4
connections=64
duration=10s
warmup=3s
command=wrk -t4 -c64 -d10s --latency -s benchmarks/wrk_latency.lua http://127.0.0.1:18083/index.html
Running 10s test @ http://127.0.0.1:18083/index.html
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.20ms   79.40ms 267.55ms   78.87%
    Req/Sec     6.11k     2.07k   11.25k    70.25%
  Latency Distribution
     50%  226.00us
     75%  119.76ms
     90%  196.40ms
     99%  243.14ms
  244056 requests in 10.05s, 72.14MB read
Requests/sec:  24294.39
Transfer/sec:      7.18MB
requests=244056
duration_us=10045778
bytes=75645165
latency_p50_us=226.00
latency_p95_us=222143.00
latency_p99_us=243140.00
errors_connect=0
errors_read=0
errors_write=0
errors_status=0
errors_timeout=0